import 'package:flutter/material.dart';

class Shivneri extends StatelessWidget {
   Shivneri({super.key});

  String info = '''
शिवनेरी किल्ला हा भारताच्या महाराष्ट्र राज्यातील एक किल्ला आहे. शिवनेरीचा हा प्राचीन किल्ला महाराष्ट्र राज्यात जुन्नर शहराजवळ, पुण्यापासून १०५ किलोमीटरवर आहे. भारत सरकारने या किल्ल्याला दिनांक २६ मे, इ.स. १९०९ रोजी महाराष्ट्रातील राष्ट्रीय संरक्षित स्मारक म्हणून घोषित केलेले आहे.[१]

१९ फेब्रुवारी १६३० रोजी छत्रपती शिवाजी महाराजांचा जन्म शिवनेरी गडावर झाला होता. हा किल्ला खूप प्रसिद्ध आहे.

या किल्ल्याला चारही बाजूंनी कठीण चढाव असून त्याला जिंकावयास कठीण असा बालेकिल्ला आहे. किल्ल्यावर शिवाई देवीचे छोटे मंदिर व जिजाबाई व बाल-शिवाजी यांच्या प्रतिमा आहेत.
या किल्ल्याचा आकार शंकराच्या पिंडीसारखा आहे.

शिवनेरी अगदी जुन्नर शहरात आहे. जुन्नरमधे शिरतानाच शिवनेरीचे दर्शन होते. किल्ला तसा फार मोठा नाही. १६७३ मध्ये ईस्ट इंडिया कंपनीतील डॉ. जॉन फ्रायर याने या किल्ल्याला भेट दिली होती. त्याने आपल्या साधनग्रंथात, या किल्ल्यावर हजार कुटुंबांना सात वर्षे पुरेल एवढी शिधासामुग्री आहे असा उल्लेख केला आहे.

इतिहास
‘जीर्णनगर’, ‘जुन्नेर’ म्हणजेच जुन्नर हे गाव इसवी सन पूर्व काळापासून प्रसिद्ध आहे. ही शक राजा नहपानाची राजधानी होती.

सातवाहन राजा गौतमीपुत्र सातकर्णी याने शकांचा नाश केला आणि जुन्नर व येथील सर्व परिसरावर आपले वर्चस्व प्रस्थापित केले. नाणेघाट हा पुरातन व्यापारी मार्ग आहे. या मार्गावरून फार मोठ्या प्रमाणात वाहतूक चालत असे. यावर नजर ठेवण्यासाठी या मार्गावरील दुर्गांची निर्मिती करण्यात आली. सातवाहनांची सत्ता स्थिरावल्यानंतर त्यांनी येथे अनेक ठिकाणी लेणी खोदवून घेतली.

सातवाहनांनंतर शिवनेरी चालुक्य व राष्ट्रकूट या राजवटींच्या सत्तेखाली होता. ११७० ते १३०८ च्या सुमारास यादवांनी येथे आपले राज्य स्थापन केले आणि याच काळात शिवनेरीला गडाचे स्वरूप प्राप्त झाले.

इ.स. १४४३ मध्ये मलिक-उल-तुजार याने यादवांचा काळात सेवेत असलेल्या स्थानिक कोळी सरदारांचा पराभव करून किल्ला सर केला. अशा प्रकारे किल्ला बहमनी राजवटीखाली आला. इ.स. १४७० मध्ये मलिक-उल-तुजारचा प्रतिनिधी मलिक महंमद याने किल्ला नाकेबंद करून पुन्हा सर केला. १४४६ मध्ये मलिक महंमदच्या वडिलांच्या मृत्यूनंतर निजामशाहीची स्थापना झाली. पुढे १४९३ मध्ये इथली राजधानी गडावरून अहमदनगरला हलवण्यात आली. इ.स. १५६५ मध्ये सुलतान मूर्तिजा निजामाने आपला भाऊ कासीम याला या गडावर कैदेत ठेवले होते.

यानंतर इ.स. १५९५ मध्ये किल्ला व जुन्नर प्रांत मालोजी राजे भोसले यांच्याकडे आला. जिजाबाईंचे वडील जाधवराव यांच्या हत्येनंतर १६२९ मध्ये जिजामाता गरोदर असताना शहाजीने त्यांना ५०० स्वार त्यांच्या सोबत देऊन रातोरात शिवनेरीवर नेले. ‘शिवनेरी गडावर श्रीभवानीमाता शिवाईला जीजाऊने नवस केला जर आपल्याला पुत्र झाला तर तुझें नाव ठेवीन.

शके १५५१ शुक्ल नाम संवत्सरे, फाल्गुन वद्य तृतीयेला, शुक्रवारी सूर्यास्तानंतर शिवाजीराजे यांचा जन्म जाला. तारीख होती १९ फेब्रुवारी, इसवी सन १६३०. इ.स. १६३२ मध्ये जिजाबाईने शिवाजीसह गड सोडला आणि १६३७ मध्ये किल्ला मोगलांच्या ताब्यात गेला.

सन १६३२मध्ये किल्ल्याचे किल्लेदार सिधोजी विश्वासराव हे होते. त्यांच्या कन्येचा विवाह शहाजी पुत्र संभाजी राजे यांचाशी झाला होता.

जुन्नर रणसंग्रामात शहाजीपुत्र थोरले संभाजी राजे यांनी पराक्रम केला होता.(इतिहासात दुर्लक्षित युद्ध ) शायिस्ताखानाने जुन्नर जिकलं पण संभाजी राजांच्या अतुलनीय पराक्रमामुळे शिवनेरी जिंकता आले नाही. त्यामुळे जुन्नर मोघलाईत तर शिवनेरी निजामशाहीत अशी परिस्थिती होती.

सन १६५० मध्ये मोगलांविरूद्ध येथील महादेव कोळ्यांनी बंड केले. यांचे नेतृत्व सरनाईक आणि किल्ल्याचे किल्लेदार खेमाजी रघतवान यांनी केले. यात मोगलांचा विजय झाला. पुढे इ.स. १६७३मध्ये शिवनेरीचा किल्लेदार अजीजखान याला फितवून किल्ल्याला माळ लावून सर करण्याचा अयशस्वी प्रयत्‍न शिवाजी राजांनी केला.

शिवरायांच्या उत्तरेकडील मोहिमेवेळी पेशवे मोरोपंत पिंगळे यांनी शिवनेरी घेण्याचा प्रयत्न केला, पण त्यांना यश आलं नाही. शिवरायांना त्यांच्या जीवनात जंजिरा आणि शिवनेरी जिंकता आले नाही अशी नोंद आहे.( पण स्वराज्याचा सीमा ह्या साल्हेर पर्यंत होत्या. त्यामुळे जुन्नर/शिवनेरी सारखा प्रांत नसणे शंकास्पद आहे. तसेच चावंड, हडसर, जीवधन सारखे किल्ले स्वराज्यात होते. तसेच शंभूराजांवेळी औरंगझेबाने रामशेजला वेढा टाकणाऱ्या मोघली सरदारांना जुन्नरवर हल्ला करून ताब्यात घेण्यास सांगितले असे पुरावे आहेत)

मोघलाईत शिवनेरीचे अनेक किल्लेदार होते. अजीजखान, फत्तेखान, मुन्शी काझी यासारखे अनेक होते. आबाभट नावाच्या व्यक्तीने धर्मांतर करून मोघलाईत प्रवेश केला.[ संदर्भ हवा ] औरंगझेबाने त्याला शिवनेरीचा किल्लेदार म्हणून नेमले. यातील अजीजखान हा पराक्रमी होता.

इ.स. १६७८ मध्ये जुन्नर प्रांत लुटला गेला आणि मराठ्यांनी किल्ला घेण्याचा परत एकदा प्रयत्‍न केला, मात्र अपयश पदरात पडले. पुढे ३८ वर्षांनंतर १७१६ मध्ये शाहूमहाराजांनी किल्ला मराठेशाहीत आणला व नंतर तो पेशव्यांकडे हस्तांतरित करण्यात आला.

इ.स. १७५५ च्या पेशवे-आंग्रे युद्धानंतर नाना साहेब पेशव्यांनी तुळाजीला शिवनेरीवर कैदेत ठेवले होते. तुळाजींनी सुटकेसाठी स्थानिक कोळी सरदारांची मदत घेतली होती. त्यामुळे नानासाहेबांनी चिडून जाऊन कोळी सरदारांची वतने, जमिनी, जहागीरदारी जप्त केल्या अशी पेशवे दप्तरात नोंद आहे.

इ.स. १७६४मध्ये माधवराव पेशवे यांनी प्रशासनात केलेल्या बदलाची परिणती, शिवनेरी आणि पुरंदर किल्ल्याच्या कोळ्यांनी केलेल्या बंडात झाली. शिवनेरीवरील कोळ्यांना रामचंद्र शिवाजी माने याने कामावरून कमी केले होते. रामचंद्र माने याने १५ सप्टेंबर १७६४ रोजी शनिवारवाड्यावर राघोबादादा यांस बंड मोडून काढणे अवघड जात असल्याबद्दलची माहिती पत्राद्वारे कळवली होती. महादेव कोळी समाज एकत्रित जमाव करून अचानक हल्ला करतात अश्याच प्रकारे गनिमी काव्याप्रमाणे त्यानी जीवधन, चावंड, हडसर यासारख्या किल्लांचा ताबा घेतला होता. नंतर पुढे शिवनेरीवरील उधो विश्वेश्वराचे धोरणांना विरोध करण्यासाठी बंड केले.

सन १७६५मध्ये महादेव कोळ्यांनी दुसरे बंड केले. या बंडाचे नेतृत्व जुन्नरच्या मावळतील देशमुख/नाईक संताजी शेळकंदे यांनी केले. यामध्ये त्यांनी शिवनेरीचा ताबा घेतला. हे बंड मोडून काढण्यासाठी पुण्याहून बारभाईंनी आणि सवाई माधवरावांनी उधो विश्वेश्वरच्या मदतीला गारद्यांना पाठवले. पुढे बंड मोडून काढले आणि महादेव कोळी सरदारांना शिक्षा करण्यात आली. संताजी मात्र पळून जाण्यात यशस्वी झाले. वारंवार होणाऱ्या बंडामुळे पेशवे हैराण झाले. पुढे सन १७७१मध्ये नाना फडणीसांनी संताजी बरोबर तह केला आणि त्यांना सरदारकी बहाल केली आणि शिवनेरीवर पुन्हा कोळ्यांना सेवेत रुजू केले.

पेशवे काळात शिवनेरीचा उपयोग कैद्यांसाठी केला जात होता. शिवनेरी किल्ल्यावरील कैद्यांना काही आनंदाच्या प्रसंगी सोडूनदेखील देण्यात येत होते. १८ एप्रिल १७७४ रोजी सवाई माधवराव यांचा जन्म झाला. या आनंदाप्रीत्यार्थ बारभाई मंडळाने शिवनेरी आणि नारायणगड यांवरील कैद्यांना सोडून देण्यात आले होते, अशी नोंद आहे. काळाच्या ओघात शिवनेरीवरील कैदखानाची पडझड होऊन गेली.

सन १० मे १८१८ मध्ये मेजर एल्ड्रिजनने शिवनेरी किल्ल्याला वेढा घातला. किल्लेदाराने काही काळ किल्ला लढवला. नंतर त्याने किल्ला सोडून हडसरच्या किल्ल्याचा किल्लेदाराकडे आश्रय घेतला अशी इतिहासात नोंद आहे.

महादेव कोळी चौथरा
शिवाजी महाराजांच्या पुणे परिसरातील कारवाया आदिलशाहीला खुपत होत्या. मोगलांना जरी त्या ठाऊक असल्या तरी अजून त्यांना त्याचा थेट उपसर्ग होत नव्हता. त्याच सुमाराला काही महादेव कोळी लोकांनी मोगलांविरुद्ध आघाडी उघडून जुन्नर व शिवनेरीचा ताबा घेतला. ह्यापूर्वी हा भाग निजामशाहीकडे होता. निजामशाही पडल्यानंतर सीमाभागाकडे आदिलशाहीचे व मोगलांचे थोडे दुर्लक्ष होत होते. कदाचित ह्याचा फायदा घेऊन ह्या महादेव कोळ्यांनी त्या प्रांतावर अधिकार स्थापित केला असावा. मोगलांनी ह्यावर लगेच उपाययोजना करण्यासाठी व महादेव कोळ्यांना परास्त करण्यासाठी एक भली मोठी फौज पाठवली. शिवनेरीला वेढा पडला व लवकरच महादेव कोळ्यांच्या नवख्या सैन्याने बलाढ्य मोगल सैन्यापुढे नांगी टाकली. सुमारे १५०० महादेव कोळ्यांना जेरबंद करण्यात आले. त्यांचे अतोनात हाल करून नंतर माथ्यावरच्या एका चौथऱ्यावर त्यांचा शिरच्छेद करण्यात आला. ह्या नरसंहाराची आठवण म्हणून आज त्या चौथऱ्याला कोळी चौथरा म्हणतात. नंतर त्या चौथऱ्यावर एक घुमटी बांधली गेली व त्यावर पारसीमधे दोन शिलालेखदेखील आहेत. या उठावाचे नेतृत्व सरनाईक व किल्ल्याचे किल्लेदार खेमाजी रघतवान यांनी केले.यात सरनाईकाच्या कुटूंबाला,नातेवाईकांना तसेच 52 मावळातील देशमुख/नाईकांना यांची धरपकड करून शिरछेद करण्यात आला. यात लहान मुले तसेच स्त्रियांचा देखील समावेश होता. आपली दहशत बसावी म्हणून तसेच पुन्हा उठाव होऊ नये म्हणून मोघलांनी असे भयानक दुष्कृत्य केले. [२]

गडावर जाण्याच्या वाटा
गडावर जाण्याच्या दोन प्रमुख वाटा जुन्नर गावातूनच जातात. पुणेकरांना तसेच मुंबईकरांना एका दिवसात शिवनेरी पाहून घरी परतता येते.

साखळीची वाट :
या वाटेने गडावर यायचे झाल्यास जुन्नर शहरात शिरल्यानंतर नव्या बसस्टँड समोरील रस्त्याने छत्रपती शिवाजी महाराजांच्या पुतळ्याजवळ यावे. येथे चार रस्ते एकत्र मिळतात. डाव्या बाजूस जाणाऱ्या रस्त्याने साधारणतः एक किलोमीटर गेल्यावर रस्त्याच्या उजव्या कडेला एक मंदिर लागते. मंदिरासमोरून जाणारी मळलेली पायवाट थेट शिवनेरी किल्ल्याच्या एका कातळभिंतीपाशी घेऊन जाते. भिंतीला लावलेल्या साखळीच्या आणि कातळात खोदलेल्या पायऱ्यांच्या साह्याने वर पोहचता येते. ही वाट थोडी अवघड असून गडावर पोहचण्यास पाऊण तास लागतो.

सात दरवाज्यांची वाट :
छत्रपती शिवाजी महाराजांच्या पुतळ्यापासून डाव्या बाजूच्या रस्त्याने चालत सुटल्यास डांबरी रस्ता आपणास गडाच्या पायऱ्यांपाशी घेऊन जातो. या वाटेने गडावर येताना सात दरवाजे लागतात. पहिला महादरवाजा, दुसरा पीर दरवाजा, तिसरा परवानगीचा दरवाजा, चौथा हत्ती दरवाजा, पाचवा शिपाई दरवाजा, सहावा फाटक दरवाजा आणि सातवा कुलाबकर दरवाजा. या मार्गे किल्ल्यावर पोहचण्यासाठी दीड तास लागतो.

कसे जाल ?
मुंबईहून माळशेज मार्गेः
जुन्नरला येतांना माळशेज घाट पार केल्यावर '८ ते ९ कि.मी.’ अशी एक पाटी रस्त्याच्या कडेला लावलेली दिसते. हा मार्ग गणेश खिंडीतून शिवनेरी किल्ल्यापर्यंत जातो. या मार्गाने गडावर पोहचण्यास मुंबईपासून एक दिवस लागतो

पुणेहून नारायणगाव मार्गेः
पुणे मधून नारायणगाव पर्यंत साधारणतः 75 कि.मी. अंतरावर पुणे-नाशिक मार्गे व त्यानंतर नारायणगाव-जुन्नर मार्गे 15 कि.मी.
''';
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text(
          "शिवनेरी किल्ला (Shivneri Fort)"
        ),
      ),
      body: Container(
        margin: EdgeInsets.all(10),
        height: double.infinity,
        color: Color.fromARGB(255, 56, 54, 54),
        child: SingleChildScrollView(
          scrollDirection: Axis.vertical,
          child: Text( info,
          style: TextStyle(
            color: Colors.white,
            fontSize: 20,
            fontWeight: FontWeight.normal
          )),
        ),
      ),
    );
  }
}